; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	thermograph0 - mode
	thermograph3 - mode
	image1 - mode
	thermograph2 - mode
	Star6 - direction
	GroundStation3 - direction
	Star10 - direction
	GroundStation7 - direction
	Star11 - direction
	GroundStation8 - direction
	Star0 - direction
	Star9 - direction
	Star2 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation5 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument4 thermograph3)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(pointing satellite3 GroundStation4)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph3)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph3)
))

)

; plan
1. (turn_to satellite3 groundstation4 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 groundstation4)
   goals met: 1 of 6
2. (turn_to satellite2 groundstation7 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation7)
   goals met: 1 of 6
3. (turn_to satellite1 groundstation5 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation5)
   goals met: 2 of 6
4. (turn_to satellite0 groundstation3 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 6
5. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 2 of 6
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
7. (calibrate satellite2 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 2 of 6
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 6
9. (turn_to satellite0 planet12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet12)
   goals met: 2 of 6
10. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 6
11. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 3 of 6
12. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 4 of 6
13. (turn_to satellite2 planet13 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 planet13)
   goals met: 4 of 6
14. (take_image satellite2 planet13 instrument2 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 5 of 6
15. (turn_to satellite2 planet15 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet15)
   goals met: 5 of 6
16. (take_image satellite2 planet15 instrument2 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 6 of 6
